; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=240, out_folder=./training, instance_id=40, seed=2064, goal_proportion=0.03

(define (problem blocksworld-40)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 - object)
 (:init 
    (arm-empty)
    (clear b94)
    (on b94 b186)
    (on b186 b77)
    (on b77 b120)
    (on b120 b106)
    (on b106 b73)
    (on b73 b239)
    (on-table b239)
    (clear b165)
    (on b165 b107)
    (on-table b107)
    (clear b48)
    (on b48 b187)
    (on b187 b159)
    (on-table b159)
    (clear b205)
    (on b205 b97)
    (on b97 b109)
    (on b109 b99)
    (on b99 b221)
    (on-table b221)
    (clear b22)
    (on-table b22)
    (clear b138)
    (on b138 b209)
    (on-table b209)
    (clear b75)
    (on b75 b29)
    (on b29 b46)
    (on b46 b140)
    (on-table b140)
    (clear b125)
    (on b125 b2)
    (on b2 b53)
    (on b53 b149)
    (on b149 b119)
    (on-table b119)
    (clear b86)
    (on-table b86)
    (clear b80)
    (on b80 b179)
    (on b179 b171)
    (on b171 b228)
    (on b228 b194)
    (on b194 b207)
    (on-table b207)
    (clear b211)
    (on b211 b101)
    (on-table b101)
    (clear b144)
    (on b144 b62)
    (on b62 b217)
    (on b217 b234)
    (on b234 b96)
    (on b96 b28)
    (on b28 b67)
    (on-table b67)
    (clear b148)
    (on b148 b51)
    (on-table b51)
    (clear b47)
    (on b47 b195)
    (on b195 b9)
    (on-table b9)
    (clear b14)
    (on b14 b233)
    (on-table b233)
    (clear b52)
    (on b52 b160)
    (on b160 b61)
    (on-table b61)
    (clear b174)
    (on-table b174)
    (clear b222)
    (on b222 b3)
    (on b3 b68)
    (on b68 b11)
    (on b11 b199)
    (on b199 b35)
    (on-table b35)
    (clear b31)
    (on-table b31)
    (clear b213)
    (on b213 b230)
    (on b230 b122)
    (on-table b122)
    (clear b115)
    (on-table b115)
    (clear b173)
    (on b173 b42)
    (on b42 b170)
    (on b170 b193)
    (on b193 b137)
    (on-table b137)
    (clear b163)
    (on b163 b191)
    (on b191 b36)
    (on b36 b18)
    (on b18 b130)
    (on-table b130)
    (clear b164)
    (on b164 b100)
    (on b100 b237)
    (on b237 b172)
    (on b172 b145)
    (on b145 b5)
    (on b5 b135)
    (on b135 b220)
    (on b220 b74)
    (on b74 b134)
    (on-table b134)
    (clear b126)
    (on b126 b102)
    (on-table b102)
    (clear b55)
    (on-table b55)
    (clear b56)
    (on-table b56)
    (clear b90)
    (on b90 b38)
    (on b38 b44)
    (on b44 b21)
    (on b21 b40)
    (on b40 b225)
    (on b225 b132)
    (on b132 b98)
    (on-table b98)
    (clear b37)
    (on-table b37)
    (clear b190)
    (on b190 b57)
    (on b57 b197)
    (on b197 b236)
    (on b236 b208)
    (on b208 b151)
    (on b151 b41)
    (on b41 b113)
    (on b113 b8)
    (on b8 b32)
    (on b32 b69)
    (on b69 b25)
    (on b25 b201)
    (on b201 b129)
    (on b129 b181)
    (on b181 b232)
    (on b232 b178)
    (on b178 b216)
    (on b216 b158)
    (on-table b158)
    (clear b85)
    (on b85 b184)
    (on b184 b155)
    (on b155 b210)
    (on b210 b131)
    (on-table b131)
    (clear b45)
    (on b45 b82)
    (on b82 b104)
    (on b104 b167)
    (on b167 b175)
    (on-table b175)
    (clear b33)
    (on b33 b166)
    (on b166 b30)
    (on b30 b156)
    (on b156 b110)
    (on b110 b19)
    (on-table b19)
    (clear b146)
    (on b146 b72)
    (on-table b72)
    (clear b203)
    (on-table b203)
    (clear b89)
    (on b89 b133)
    (on b133 b58)
    (on b58 b214)
    (on b214 b64)
    (on b64 b59)
    (on-table b59)
    (clear b12)
    (on b12 b93)
    (on b93 b142)
    (on b142 b15)
    (on b15 b150)
    (on b150 b92)
    (on b92 b79)
    (on-table b79)
    (clear b49)
    (on-table b49)
    (clear b192)
    (on b192 b183)
    (on b183 b223)
    (on-table b223)
    (clear b43)
    (on-table b43)
    (clear b143)
    (on-table b143)
    (clear b7)
    (on b7 b224)
    (on-table b224)
    (clear b168)
    (on b168 b95)
    (on b95 b63)
    (on b63 b87)
    (on b87 b212)
    (on b212 b114)
    (on-table b114)
    (clear b218)
    (on b218 b70)
    (on-table b70)
    (clear b1)
    (on-table b1)
    (clear b71)
    (on-table b71)
    (clear b39)
    (on b39 b127)
    (on-table b127)
    (clear b161)
    (on b161 b177)
    (on b177 b141)
    (on-table b141)
    (clear b231)
    (on b231 b215)
    (on b215 b23)
    (on-table b23)
    (clear b105)
    (on b105 b13)
    (on-table b13)
    (clear b26)
    (on b26 b240)
    (on b240 b227)
    (on b227 b112)
    (on b112 b180)
    (on-table b180)
    (clear b17)
    (on-table b17)
    (clear b103)
    (on-table b103)
    (clear b108)
    (on b108 b152)
    (on b152 b60)
    (on b60 b128)
    (on b128 b123)
    (on b123 b229)
    (on b229 b154)
    (on b154 b111)
    (on-table b111)
    (clear b176)
    (on b176 b66)
    (on-table b66)
    (clear b4)
    (on b4 b84)
    (on b84 b27)
    (on-table b27)
    (clear b202)
    (on b202 b185)
    (on b185 b188)
    (on b188 b162)
    (on b162 b121)
    (on b121 b157)
    (on-table b157)
    (clear b235)
    (on b235 b196)
    (on b196 b206)
    (on b206 b226)
    (on b226 b147)
    (on b147 b88)
    (on b88 b10)
    (on b10 b20)
    (on b20 b34)
    (on b34 b6)
    (on b6 b91)
    (on b91 b81)
    (on b81 b54)
    (on b54 b136)
    (on b136 b200)
    (on b200 b139)
    (on-table b139)
    (clear b65)
    (on-table b65)
    (clear b76)
    (on b76 b50)
    (on b50 b204)
    (on b204 b16)
    (on b16 b118)
    (on b118 b116)
    (on b116 b198)
    (on b198 b83)
    (on-table b83)
    (clear b153)
    (on b153 b219)
    (on b219 b238)
    (on-table b238)
    (clear b124)
    (on b124 b117)
    (on b117 b24)
    (on b24 b189)
    (on b189 b169)
    (on b169 b78)
    (on b78 b182)
    (on-table b182))
 (:goal  (and 
    (clear b1)
    (on b1 b5)
    (on b5 b4)
    (on b4 b2)
    (on b2 b6)
    (on b6 b7)
    (on b7 b3)
    (on-table b3))))

; plan
1. (unstack b125 b2)
   deleted: (on b125 b2) (clear b125) (arm-empty)
   added: (holding b125) (clear b2)
   goals met: 1 of 8
2. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 1 of 8
3. (unstack b164 b100)
   deleted: (on b164 b100) (clear b164) (arm-empty)
   added: (holding b164) (clear b100)
   goals met: 1 of 8
4. (putdown b164)
   deleted: (holding b164)
   added: (clear b164) (arm-empty) (on-table b164)
   goals met: 1 of 8
5. (unstack b100 b237)
   deleted: (on b100 b237) (clear b100) (arm-empty)
   added: (holding b100) (clear b237)
   goals met: 1 of 8
6. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 1 of 8
7. (unstack b222 b3)
   deleted: (on b222 b3) (clear b222) (arm-empty)
   added: (holding b222) (clear b3)
   goals met: 1 of 8
8. (putdown b222)
   deleted: (holding b222)
   added: (clear b222) (arm-empty) (on-table b222)
   goals met: 1 of 8
9. (unstack b3 b68)
   deleted: (on b3 b68) (clear b3) (arm-empty)
   added: (holding b3) (clear b68)
   goals met: 1 of 8
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 8
11. (unstack b235 b196)
   deleted: (on b235 b196) (clear b235) (arm-empty)
   added: (holding b235) (clear b196)
   goals met: 2 of 8
12. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 2 of 8
13. (unstack b196 b206)
   deleted: (on b196 b206) (clear b196) (arm-empty)
   added: (holding b196) (clear b206)
   goals met: 2 of 8
14. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 2 of 8
15. (unstack b206 b226)
   deleted: (on b206 b226) (clear b206) (arm-empty)
   added: (holding b206) (clear b226)
   goals met: 2 of 8
16. (putdown b206)
   deleted: (holding b206)
   added: (clear b206) (arm-empty) (on-table b206)
   goals met: 2 of 8
17. (unstack b226 b147)
   deleted: (on b226 b147) (clear b226) (arm-empty)
   added: (holding b226) (clear b147)
   goals met: 2 of 8
18. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 2 of 8
19. (unstack b147 b88)
   deleted: (on b147 b88) (clear b147) (arm-empty)
   added: (holding b147) (clear b88)
   goals met: 2 of 8
20. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 2 of 8
21. (unstack b237 b172)
   deleted: (on b237 b172) (clear b237) (arm-empty)
   added: (holding b237) (clear b172)
   goals met: 2 of 8
22. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 2 of 8
23. (unstack b172 b145)
   deleted: (on b172 b145) (clear b172) (arm-empty)
   added: (holding b172) (clear b145)
   goals met: 2 of 8
24. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 2 of 8
25. (unstack b145 b5)
   deleted: (on b145 b5) (clear b145) (arm-empty)
   added: (holding b145) (clear b5)
   goals met: 2 of 8
26. (putdown b145)
   deleted: (holding b145)
   added: (clear b145) (arm-empty) (on-table b145)
   goals met: 2 of 8
27. (unstack b88 b10)
   deleted: (on b88 b10) (clear b88) (arm-empty)
   added: (holding b88) (clear b10)
   goals met: 2 of 8
28. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 2 of 8
29. (unstack b10 b20)
   deleted: (on b10 b20) (clear b10) (arm-empty)
   added: (holding b10) (clear b20)
   goals met: 2 of 8
30. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 8
31. (unstack b20 b34)
   deleted: (on b20 b34) (clear b20) (arm-empty)
   added: (holding b20) (clear b34)
   goals met: 2 of 8
32. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 8
33. (unstack b34 b6)
   deleted: (on b34 b6) (clear b34) (arm-empty)
   added: (holding b34) (clear b6)
   goals met: 2 of 8
34. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 2 of 8
35. (unstack b2 b53)
   deleted: (on b2 b53) (clear b2) (arm-empty)
   added: (holding b2) (clear b53)
   goals met: 2 of 8
36. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 3 of 8
37. (unstack b4 b84)
   deleted: (on b4 b84) (clear b4) (arm-empty)
   added: (holding b4) (clear b84)
   goals met: 3 of 8
38. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 4 of 8
39. (unstack b5 b135)
   deleted: (on b5 b135) (clear b5) (arm-empty)
   added: (holding b5) (clear b135)
   goals met: 4 of 8
40. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 5 of 8
41. (unstack b7 b224)
   deleted: (on b7 b224) (clear b7) (arm-empty)
   added: (holding b7) (clear b224)
   goals met: 5 of 8
42. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 6 of 8
43. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 5 of 8
44. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 8
45. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 4 of 8
46. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 8
47. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 3 of 8
48. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 3 of 8
49. (unstack b6 b91)
   deleted: (on b6 b91) (clear b6) (arm-empty)
   added: (holding b6) (clear b91)
   goals met: 3 of 8
50. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 4 of 8
51. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 8
52. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 5 of 8
53. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 8
54. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 8
55. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 8
56. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 8
57. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 8
58. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 8 of 8
